Giesekus/dilutedSolution/f=6.446Hz_zo=1mm/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          500;
        startFace       36500;
    }
    outlet
    {
        type            patch;
        nFaces          500;
        startFace       37000;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1000;
        startFace       37500;
    }
)

// ************************************************************************* //
